mhf0709/water-quality-monitoring/stm32+onenet+gprs/user/main.c
/**
	************************************************************
	************************************************************
	************************************************************
	*	文件名： 	main.c
	*
	*	作者： 		张继瑞
	*
	*	日期： 		2017-05-08
	*
	*	版本： 		V1.0
	*
	*	说明： 		接入onenet，上传数据和命令控制
	*
	*	修改记录：	
	************************************************************
	************************************************************
	************************************************************
**/

//单片机头文件
#include "stm32f10x.h"

//网络协议层
#include "onenet.h"

//网络设备
#include "m6312.h"

//硬件驱动
#include "delay.h"
#include "usart.h"
#include "beep.h"
#include "master.h"
#include "crc16.h"
#include "timer4.h"
#include "bsp_adc.h"


//C库
#include <string.h>
#include <stdio.h>

u16 time_cnt =0;	
u8 TEMP_COD_TOC_OR_NTU = 0;		


/*
************************************************************
*	函数名称：	Hardware_Init
*
*	函数功能：	硬件初始化
*
*	入口参数：	无
*
*	返回参数：	无
*
*	说明：		初始化单片机功能以及外接设备
************************************************************
*/
void Hardware_Init(void)
{
	
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);	//中断控制器分组设置

	Delay_Init();									//systick初始化
	
	Usart1_Init(115200);							//串口1，打印信息用
	
	Usart2_Init(115200);		//串口2，驱动ESP8266用
	
	RS485_Init(9600);     //RS485的初始波特率
									
	Beep_Init();	//蜂鸣器初始化
	
	ADCx_Init();   //ADC初始化
	
	UsartPrintf(USART_DEBUG, " Hardware init OK\r\n");
	
}

/*
************************************************************
*	函数名称：	main
*
*	函数功能：	
*
*	入口参数：	无
*
*	返回参数：	0
*
*	说明：		
************************************************************
*/
int main(void)
{
double C;
double T;
	
	unsigned short timeCount = 0;	//发送间隔变量
	
	unsigned char *dataPtr = NULL;
	
	Hardware_Init();				//初始化外围硬件
	
	M6312_Init();					//初始化ESP8266
	
	while(OneNet_DevLink())			//接入OneNET
	DelayXms(500);
	
	Beep_Set(BEEP_ON);				//鸣叫提示接入成功
	DelayXms(250);
	Beep_Set(BEEP_OFF);
	
	
	
while(1)
	{
		
	 if(++timeCount%80==5){
		  Master_Service(0x01,0x03,0x2600,0x0007);
			DelayXms(100);
	    RS485_RX_Service();
	    Master_Service(0x01,0x03,0x1200,0x0002);
			DelayXms(100);
	    RS485_RX_Service();	
		  Master_Service(0x02,0x03,0x2600,0x0004);
			DelayXms(100);
		  RS485_RX_Service();
			}
		if(++timeCount >= 600)									//发送间隔5s
		{				
			C=(Cod.F_data-3.3343622)*0.99775256;
			T=0.40009*C;
			RS485_RX_Service();
			UsartPrintf(USART_DEBUG,"\r\nTemp:%.2f\tCOD:%.2f\tTOC:%.2f\tNTU:%.2f\r\nTSS:%.2f\r\n",Temp.F_data,C,T,Turbidity.F_data);
	    UsartPrintf(USART_DEBUG, "OneNet_SendData\r\n");
			OneNet_SendData();									//发送数据		
			timeCount = 0;
			M6312_Clear();
		}
		
		dataPtr = M6312_GetIPD(0);
		if(dataPtr != NULL)
		OneNet_RevPro(dataPtr);
		
		DelayXms(10);
	 }
 }